/* $ObjectName=MAFLogonManagerNG_iOS */
/* $Collection=frwk.tools.ios */
/* $Domain=BC */
/* $Developer=I043975 */
/* $Description=Mobile Application Framework - iOS Reusable Tool Components */

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidParameter" = "パラメータが無効です。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationCode" = "操作コードが無効です。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCommunicationManagerError" = "サーバに接続できませんでした。ログインデータをチェックしてください。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorUserAlreadyLoggedIn" = "ユーザはすでにログインしています。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationExecutionInProgress" = "操作実行はすでに処理中です。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationContext" = "操作コンテキストが無効です。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidCommunicatorId" = "通信プロトコルの ID が無効です。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidActionItemId" = "アクションアイテム ID が無効です。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCouldNotDecideCommunicator" = "通信プロトコルを特定できませんでした。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidBackendPassword" = "パスワードをチェックしてください。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorDeviceAlreadyRegistered" = "このデバイスはすでに別のユーザに登録されています。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorPasswordsNotEqual" = "入力されたパスコードが一致しません。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "このステータスでは、この操作は許可されていません。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidServerHost" = "入力したログインデータが不十分であるか、無効です。再試行してください。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorResetErrorCheckNetwork" = "アプリをリセットできませんでした。ネットワークに接続されているかどうか確認してください。";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckLoginData" = "サーバに接続できませんでした。ログインデータをチェックしてください。";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckUsernamePassword" = "ユーザ名およびパスワードをチェックしてください。";

/* XMSG */
"keyErrDescrMAFLogonErrorConsultWithAdministrator" = "サーバに接続できませんでした。管理者に確認してください。";

/* XMSG */
"keyErrDescrMAFLogonErrorInvalidLoginData" = "入力したログインデータが不十分であるか、無効です。再試行してください。";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeCorrect" = "適切なパスコードを入力してください。";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDigit" = "1 文字以上の数字を含むパスコードを入力してください。";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDontMatch" = "入力されたパスコードが一致しません。";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeExpired" = "パスコードの有効期限が切れているため、変更する必要があります。";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLength" = "{0} 文字以上のパスコードを入力してください。";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLowercase" = "1 文字以上の小文字を含むパスコードを入力してください。";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeSpecialCharacters" = "1 文字以上の特殊文字を含むパスコードを入力してください。";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUniqueCharacters" = "{0} 文字以上の一意文字を含むパスコードを入力してください。";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUppercase" = "1 文字以上の大文字を含むパスコードを入力してください。";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateKeyGeneration" = "証明書のキーを取得できませんでした。";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateGeneration" = "証明書を取得できませんでした。";

/* XMSG */
"keyErrDescrMAFLogonErrorAppSettingsValidation" = "Application Setting property validation failed for key:";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorUnknown" = "未知のエラーが発生しました";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorAlreadyExists" = "セキュアストアはすでに存在します";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDataTypeError" = "データ型エラーが発生しました";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDoesNotExist" = "セキュアストアが存在しません";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidArg" = "引数が無効です";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidPassword" = "適切なパスコードを入力してください。";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorLocked" = "セキュアストアはロックされています";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorOutOfMemory" = "セキュアストアがメモリ不足です";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordExpired" = "パスコードの有効期限が切れているため、変更する必要があります。";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequired" = "{0} 文字以上の一意文字を含むパスコードを入力してください。";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresDigit" = "1 文字以上の数字を含むパスコードを入力してください。";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresLower" = "1 文字以上の小文字を含むパスコードを入力してください。";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresSpecial" = "1 文字以上の特殊文字を含むパスコードを入力してください。";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresUpper" = "1 文字以上の大文字を含むパスコードを入力してください。";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinLength" = "{0} 文字以上のパスコードを入力してください。";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinUniqueChars" = "{0} 文字以上の一意文字を含むパスコードを入力してください。";

/* XMSG */
"keyErrDescrMAFSecureStoreManagerErrorDeleted" = "セキュアストアが削除されました。";

/* XMSG */
"keyErrDescrMAFLogonErrorOperationNotSupported" = "操作がサポートされていません。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidMCIMSSOPin" = "SSO パスコードが無効です。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorAfariaInvalidCredentials" = "Afaria 認証情報が無効です。";

/* XMSG: message */
"keyErrDescrMAFLogonErrorClientIdentityNotFound" = "クライアント ID が見つかりません";

/* XMSG: message */
"keyErrDescrMAFLogonErrorURLValidationFailed" = "アクセスが拒否されました";

/* XMSG: message */
"keyErrDescrMAFLogonErrorXMLParserInitializationError" = "Cannot instantiate the xml parser.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorXMLParserError" = "Error during xml parsing.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorSettingsDownloadFailed" = "Settings download failed.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorHTTPDomainError" = "HTTP domain error with response status:";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidJSONData" = "JSON data is invalid";

/* XMSG: message */
"keyErrDescrMAFLogonErrorJSONParserError" = "Error during json parsing";

